#功能一:创建新闻表
#总书籍表（查书号、标题、作者、分类、索书号、出版社、入库时间、馆藏地址、库存、价格、图片、状态、备注）
#新书表（查书号、标题、作者、分类、索书号、出版社、入库时间、页数、图片、状态、备注）
#书籍简介表（查书号、内容简介、作者简介、目录）
#读者信息表（学号、密码、姓名、性别、电话、所在系、生效日期、失效日期、违章状况、累计借书、备注）
#管理员信息表（工作号、姓名、性别、电话、家庭住址、备注）
#借阅表（工作号、ISBN、读者学号、借书日期、还书日期）
#管理员_书籍（工作号、ISBN、添加时间、是否在馆）
#管理员_学生（工作号、读者学号、借还确认）


#读者信息表（学号、密码、姓名、性别、电话、所在系、班级、生效日期、失效日期、违章状况、累计借书、备注）
CREATE TABLE user(
  uid VARCHAR(10) PRIMARY KEY, #学号
  upwd VARCHAR(20) DEFAULT '000000',   #密码
  name VARCHAR(20),     #姓名
  sex VARCHAR(5),       #性别
  tel VARCHAR(30),      #电话
  dept VARCHAR(30),     #所在系
  uclass VARCHAR(30),    #班级
  violation_status INT, #违章状况
  addcount INT,         #累计借书
  remark VARCHAR(100)  #备注
);

/* 第一次插入用户数据 */
INSERT INTO user VALUES
('150301','000000','陈铭','男','13845678945','计算机科学与技术','1503',0,0,null),
('150302','000000','李颖','女','15896548542','计算机科学与技术','1503',0,0,null),
('150303','000000','张玉洁','女','13896584125','计算机科学与技术','1503',0,0,null),
('150304','000000','梁琛','男','13852631234','计算机科学与技术','1503',0,0,null),
('150305','000000','胡平','男','17596845236','计算机科学与技术','1503',0,0,null),
('150306','000000','尹紫霞','女','13852469251','计算机科学与技术','1503',0,0,null),
('150307','000000','陈镇','男','15964852315','计算机科学与技术','1503',0,0,null),
('150308','000000','刘志','男','17526314856','计算机科学与技术','1503',0,0,null),
('150309','000000','李梦桃','女','15045678952','计算机科学与技术','1503',0,0,null),
('150310','000000','朱春霓','女','18815693524','计算机科学与技术','1503',0,0,null),
('150311','000000','吴晓','男','18745612895','计算机科学与技术','1503',0,0,null),
('150312','000000','杨鹏','男','13715824683','计算机科学与技术','1503',0,0,null),
('150313','000000','刘彩英','女','13645725863','计算机科学与技术','1503',0,0,null),
('150314','000000','王瑛','男','18815964752','计算机科学与技术','1503',0,0,null),
('150315','000000','罗胜利','男','13245826475','计算机科学与技术','1503',0,0,null),
('150316','000000','丁瑜安','男','18845632587','计算机科学与技术','1503',0,0,null),
('150317','000000','郭亮','男','13842569875','计算机科学与技术','1503',0,0,null),
('150318','000000','金雅芳','女','13645821637','计算机科学与技术','1503',0,0,null),
('150319','000000','王克勤','男','13954682165','计算机科学与技术','1503',0,0,null),
('150320','000000','张勇','男','13845721569','计算机科学与技术','1503',0,0,null);


/* 第二次插入的用户数据 */
INSERT INTO user VALUES
('150401','000000','陈铭','男','13845678945','计算机科学与技术','1503',0,0,null),


#服务器端口使用编码
SET NAMES UTF8;
#丢弃数据库，如果存在的话
DROP DATABASE IF EXISTS libary;
#创建数据库
CREATE DATABASE libary CHARSET=UTF8;
USE libary;

CREATE TABLE book(
  bid INT PRIMARY KEY AUTO_INCREMENT,  #id
  ISBN VARCHAR(20),	#查书号
  title VARCHAR(20),		#标题
  author VARCHAR(20),	#作者
  classify VARCHAR(10),	#分类
  searchid VARCHAR(20),	#索书号
  press VARCHAR(20),	#出版社
  entry_time DATE,		#入库时间
  address VARCHAR(20),	#馆藏地址
  stock SMALLINT,		#库存
  price DECIMAL(7,2),	#价格
  pic VARCHAR(50),		#图片
  state BOOL DEFAULT 1,	#状态
  remark VARCHAR(200)	#备注
);

/* 第一次插入全部书籍的数据 */
INSERT INTO book VALUES
(null,"9787208141049","陈公培文集","陈公培，1901-1968著","中文","C52/1610","上海 上海人民出版社 2016","2019-2-2","一楼社科图书借阅室",50,"52.00","img/book/sufei.jpg",1,null),
(null,"9787561562284","越境的力量 历史与思想论集 盛嘉著","盛嘉 著","中文","C52/1615","厦门 厦门大学出版社 2016","2019-2-2","一楼社科图书借阅室",50,"52.00","img/book/yuejingdeliliang.png",1,null),
(null,"9787506341271","苏菲的世界（挪威） 乔斯坦·贾德著","戈德尔，1952-著","中文","I533.45/5d2","北京 作家出版社 2007","2019-2-2","一楼社科图书借阅室",50,"52.00","img/book/chengongpei.jpg",1,null),
(null,"9787506341271","潘家洵译易卜生戏剧","易卜生，1828-1906著","中文","I533.45/5d2","北京 作家出版社 2007","2019-2-2","一楼社科图书借阅室",50,"52.00","img/book/yibushengxiju.jpg",1,null),
(null,"9787309126051","跨文化背景下的北欧文学研究","孙建 主编","中文","I530.6/1","上海 复旦大学出版社 2017","2019-2-2","一楼社科图书借阅室",50,"52.00","img/book/kuawenhua.jpg",1,null),
(null,"9787535495525","回忆找到我","张抗抗, 1950- 著","中文","I267/871q","武汉 长江文艺出版社 2017","2019-2-2","一楼社科图书借阅室",50,"52.00","img/book/English.jpg",1,null),
(null,"9787221138873","特案组 毛浦光著","毛浦光著,","中文","I247.56/178","贵阳 贵州人民出版社 2017","2019-2-2","一楼社科图书借阅室",50,"52.00","img/book/teanzu.jpg",1,null),
(null,"9787560574370","审判（奥）卡夫卡著 宁瑛译","卡夫卡，1883-1924著","中文","I521.45/2h2","西安 西安交通大学出版社 2015","2019-2-2","一楼社科图书借阅室",50,"52.00","img/book/shenpan.jpg",1,null),
(null,"9787010166001","红杏出墙记","刘云若著","中文","I246.4/22a1(上)","北京 中国文史出版社 2017","2019-2-2","一楼社科图书借阅室",50,"52.00","img/book/hongxing.jpg",1,null),
(null,"9787568205306","新娘·女主人·十字架（挪威）温塞特著","温塞特，1882-1949著","中文","I533.45/4.1(1)","北京 北京理工大学出版社 2015","2019-2-2","一楼社科图书借阅室",50,"52.00","img/book/xinniang.jpg",1,null),
(null,"9787540479497","生命本就纯真 周国平著","周国平，1945-著","中文","I267/503bf","长沙 湖南文艺出版社 2017","2019-2-2","一楼社科图书借阅室",50,"52.00","img/book/shengmingbenjiuchunzhen.jpg",1,null),
(null,"9787108055637","视差 美国与东亚的关系","卡明斯，1943-著","中文","D871.22/68","北京 生活·读书·新知三联书店2016","2019-2-2","一楼社科图书借阅室",50,"52.00","img/book/shicha.jpg",1,null),
(null,"9787010166001","话语与贸易摩擦","吴鹏 著","中文","F752.7712/46","北京 人民出版社 2017","2019-2-2","一楼社科图书借阅室",50,"52.00","img/book/huayumaoyi.jpg",1,null),
(null,"9787516630624","暴怒","英德里达松","中文","I535.45/5e","北京 新华出版社 2017","2019-2-2","一楼社科图书借阅室",50,"52.00","img/book/baonu.jpg",1,null),
(null,"9787503471391","酒眼灯唇录","刘云若著","中文","I246.4/22g1","北京 中国文史出版社 2017","2019-2-2","一楼社科图书借阅室",50,"52.00","img/book/jiuyandengchunlu.jpg",1,null);

/* 第二次插入全部书籍的数据 */
INSERT INTO book VALUES
(null,"9787100158022","杜甫诗选 典藏本","杜甫, 712-770 著","中文","I222.742/28z","北京 商务印书馆 2018","2019-3-2","一楼社科图书借阅室",50,"52.00","img/nbook/nbook1.jpg",1,null),
(null,"9787510217692","检查研究（2018年第2辑）","尹吉 方晓琳 严正华 主编","中文","D926.3-55/1(2016,2) D926.3-55/1(2016,4)","中国检察出版社 2006-","2019-3-2","二楼新书阅览室",50,"52.00","img/nbook/nbook2.jpg",1,null),
(null,"9787301298824","Sping 5 开发大全","柳伟卫 著","计算机","TP312JA/552","北京 北京大学出版社 2018","2019-3-2","二楼新书阅览室",50,"52.00","img/nbook/nbook3.jpg",1,null),
(null,"9787115438140","计算机思维与计算文化(中文)","王永全 单美静 主编","计算机","TP3/520","北京 人民邮电出版社 2016","2019-3-2","二楼新书阅览室",50,"52.00","img/nbook/nbook4.jpg",1,null),
(null,"9787540782955","论语心要别裁参译下(中文)","赵强 译注","中文","B222.2/49(上)","桂林 漓江出版社 2017","2019-3-2","二楼新书阅览室",50,"52.00","img/nbook/nbook5.jpg",1,null),
(null,"9787030527028","NBIoT技术详解等","解运洲 著","计算机","TP393.409/48","北京 科学出版社 2017","2019-3-2","二楼新书阅览室",50,"52.00","img/nbook/nbook6.jpg",1,null),
(null,"9787509646373","兼论中国银行业的顺周期效应","刘鹏 著","经济科学","F832/313","北京 经济管理出版社 2016","2019-3-2","二楼新书阅览室",50,"52.00","img/nbook/nbook7.jpg",1,null),
(null,"9787030546104","功能视野下我国职业教育...","董显辉 著","教育学","G719.2/46","北京 科学出版社 2017","2019-3-2","二楼新书阅览室",50,"52.00","img/nbook/nbook8.jpg",1,null),
(null,"9787030507259","英语非人称构式的认知研究...","马应聪 著","英文","H314/486","北京 科学出版社 2017","2019-3-2","二楼新书阅览室",50,"52.00","img/nbook/nbook9.jpg",1,null),
(null,"9787030507259","功能视野下我国职业教育...","黑马程序员 编著","教育学","H314/486","北京 科学出版社 2017","2019-3-2","二楼新书阅览室",50,"52.00","img/nbook/nbook10.jpg",1,null);

/* 中文、英文、教育学、经济科学、计算机 */

/* #图书分类表
CREATE TABLE book_classify(
  id INT PRIMARY KEY AUTO_INCREMENT,
  classify VARCHAR(20),
  count INT,
  FOREIGN KEY(id) references book(bid)
);


#书籍简介表（查书号、内容简介、作者简介、目录）
CREATE TABLE book_in(
	sid INT,
	ISBN VARCHAR(20),
	content_intro VARCHAR(500),
	author_intro VARCHAR(200),
	catalog VARCHAR(500),
	FOREIGN KEY(sid) references book(bid)
); */

/* 新书表 */
CREATE TABLE newbook(
  nid INT PRIMARY KEY AUTO_INCREMENT,  #id
  ISBN VARCHAR(20),	    #查书号
  title VARCHAR(20),		#标题
  author VARCHAR(20),	  #作者
  classify VARCHAR(10),	#分类
  searchid VARCHAR(20),	#索书号
  press VARCHAR(20),	  #出版社
  entry_time DATE,		  #入库时间
  stock SMALLINT,		    #库存
  price DECIMAL(7,2),	  #价格
  page SMALLINT,        #页数
  pic VARCHAR(50),		  #图片
  state BOOL DEFAULT 1,	#状态
  remark VARCHAR(200),	#备注
  content_intro VARCHAR(500), #内容简介
	author_intro VARCHAR(200)  #作者简介
);


/* 第一次插入新书的数据 */
INSERT INTO newbook VALUES
(null,"9787100158022","杜甫诗选 典藏本","杜甫, 712-770 著","中文","I222.742/28z","北京 商务印书馆 2018","2019-3-2",50,"52.00",362,"img/nbook/nbook1.jpg",1,null,"杜甫是伟大的唐代诗人，在人格境界和诗歌造诣两方面都达到了超凡入圣的程度，被誉为“诗圣”。杜诗不仅是大唐王朝由盛转衰的时代画卷，而且是记录人们心底波澜的心灵史，被誉为“诗史”。杜诗鲜明地体现了以儒学为代表的中国传统价值观，具有陶冶心灵、启发人生的重大意义。现存杜诗1400余首，注本繁多，故阅读杜诗可从选本开始。 《杜甫诗选(古代诗词典藏本)》撰者莫砺锋、童强热爱杜甫，长期研读杜诗，颇多心得。在此选录杜甫的代表作255首，并以“注释”和“评赏”帮助读者理解、欣赏。读者阅后更加理解热爱杜甫，并有兴趣阅读杜甫全集，则撰者幸甚。","莫砺锋，江苏无锡人，1949年生，研究生学历，1984年在南京大学获文学博士学位。现为南京大学人文社会科学资深教授、南京大学中国诗学研究中心主任，兼任新闻出版署全国古籍整理与出版规划领导小组成员、教育部社会科学委员会委员、中国韵文学会理事、中国古代文学理论学会理事、中国唐代文学学会常务理事、中国杜甫研究会副会长、中国宋代文学学会会长。长期从事中国文学史、唐宋诗学、宋代理学与文学等领域的研究。学术著作有《江西诗派研究》《杜甫评传》《朱熹文学研究》《古典诗学的文化观照》《杜甫诗歌讲演录》《唐宋诗歌论集》《文学史沉思拾零》等。其他著作有《浮生琐忆》《莫砺锋诗话》《漫话东坡》《莫砺锋说唐诗》《莫砺锋评说白居易》《宁钝斋杂著》《诗意人生》等。主编教材有《中国文学史·宋代卷》。编译有《神女之探寻》。"),
(null,"9787510217692","检查研究（2018年第2辑）","尹吉 方晓琳 严正华 主编","中文","D926.3-55/1(2016,2) D926.3-55/1(2016,4) D926.3-55/1(2016,3) D926.3-55/1(2017,5) D926.3-55/1(2017,1) D926.3-55/1(2017,2) D926.3-55/1(2018,1) D926.3-55/1(2017,6) D926.3-55/1(2018,2)","中国检察出版社 2006-","2019-3-2",50,"52.00",99,"img/nbook/nbook2.jpg",1,null,"《检察研究(2018年第2辑)》由江苏省人民检察院主办，江苏省检察官协会组织编写，由严正华主编，坚持以推动完善和发展社会主义检察制度为宗旨，坚持理论联系实际，坚持应用理论研究和基础理论研究并重，主要刊载检察实务、理论、改革等方面的调研文章。",null),
(null,"9787301298824","Sping 5 开发大全","柳伟卫 著","计算机","TP312JA/552","北京 北京大学出版社 2018","2019-3-2",50,"52.00",600,"img/nbook/nbook3.jpg",1,null,"自Spring诞生以来，以 Spring 技术栈为核心的企业级应用开发方式深入人心，已然成为Java EE开发的最佳实践。随着Spring 5版本的发布，Spring自身也发生了巨大变革。本书力求全面介绍Spring框架，涵盖了Spring核心、测试、数据访问、集成、Web开发、微服务等所有相关内容。同时，本书基于Spring 5最新版本来编写，除了涉及Spring 5版本的新特性之外，还介绍了 REST 服务、响应式 Web 开发、微服务设计、Spring Boot、Spring Cloud 等方面的前瞻技术。而且除了讲解Spring的理论知识外，还在每个知识点上辅以大量的代码案例，理论联系实际，可操作性强。",null),
(null,"9787115438140","计算机思维与计算文化(中文)","王永全 单美静 主编","计算机","TP3/520","北京 人民邮电出版社 2016","2019-3-2",50,"52.00",227,"img/nbook/nbook4.jpg",1,null,"王永全、单美静主编的《计算思维与计算文化》以提升知识和技能、素养和能力为目标，兼顾广度和深度，融多学科交叉领域知识为一体，对计算思维与计算文化涉及的基本概念和知识、基本技能和应用等相关内容进行了较为全面系统地阐述和分析。主要包括：计算思维概述、信息与信息处理技术、数学与数学模型、计算与计算方法、计算文化、程序设计思想与算法基础、网络与网络通信、互联网与新型网络、数据分析与科学决策、人工智能与智能计算、案例与实践等知识和内容。 本书不仅可作为高等院校各专业，特别是非计算机专业开设《计算思维与计算文化》等相关课程的参考书，同时也可供社会各领域工作者了解和学习计算思维与计算文化等相关知识参考或使用。",null),
(null,"9787540782955","论语心要别裁参译下(中文)","赵强 译注","中文","B222.2/49(上)","桂林 漓江出版社 2017","2019-3-2",50,"52.00",438,"img/nbook/nbook5.jpg",1,null,"《论语》是记载孔子言语行事的儒家经典，其影响遍及政治、文化、教育、伦理等各个领域。台湾地区著名学者南怀瑾先生以渊博的知识，旁征博引，结合孔子在每一章句讲话的环境、语气解读《论语》，使得该书读起来活泼、有生气。《论语心要》编委怀师文化编委会以弘扬传统文化为宗旨，以探寻南师精神理念为己任，依照南师心愿编辑了《论语心要——“别裁”参译》2，收集了《论语》后十篇内容。","赵强，原太湖大学堂资深校长，得遇南师感应教化，感悟人生。现任“怀师文化编委会”主编，编辑出版了南怀瑾纪念文集《人道之路》《师道》《教育与人性》等，赢得了广大教师、家长、社会各界及有关领导的赞誉和好评。 “怀师文化”以弘扬中国传统文化为宗旨，以深入探究南师的文化精神和教育理念为己任，依照南师心愿，致力于传播中国传统文化，推动公益性“中国传统文化教育实验基地”建设，继续南师“教育实验”的实践与推广。 教育理想：创建以中国传统文化为根基，融合东西方文化之精华的、世界一流“国际化”学校（学院）。 教育理念：关注人性，尊重生命，去发现那丰富多彩的、充满阳光和活力的生命世界。为新时代培养具有中国文化底蕴和国际视野的社会主义建设者和接班人。"),
(null,"9787030527028","NBIoT技术详解等","解运洲 著","计算机","TP393.409/48","北京 科学出版社 2017","2019-3-2",50,"52.00",327,"img/nbook/nbook6.jpg",1,null,"NB—IoT技术的诞生承载着全球电信运营商对物联网生态体系的变革。NB—IoT技术具有广覆盖、低功耗、低成本、大连接等特点，定位于运营商级、基于授权频谱的低速率物联网市场，可被广泛应用在不同的物联网垂直应用领域，并就此开启智能连接的新时代。 NB—IoT产业已经是全球化趋势，受到了全球物联网产业链的普遍关注。解运洲著的《NB-IoT技术详解与行业应用(物联网工程专业系列教材)》的目的是让读者更好地理解NB—IoT技术，掌握NB—IoT全产业链体系架构，并清晰认识NB—IoT适用的物联网垂直应用领域。 本书适合NB—IoT产业链从业人员从全局角度掌握NB—IoT技术带来的突破性革命，适合高等院校物联网工程专业作为教材使用，也适合对物联网感兴趣的读者参考阅读。","解运洲：中国NB—IOT产业联盟发起人。毕业于西安电子科技大学通信工程学院，深耕数据通信、无线通信、M2M通信、移动支付、智慧城市等领域。从2010年开始从事物联网行业的产业研究和咨询服务。熟悉物联网产业链发展现状和发展趋势。掌握多项物联网垂直应用领域的解决方案。NB—10T技术的积极推广者，擅长组织物联网领域的生态大会和技术研讨，拥有物联网领域的广泛人脉，积极营造政府部门、运营商、物联网企业等共生共荣的产业链生态圈。"),
(null,"9787509646373","兼论中国银行业的顺周期效应","刘鹏 著","经济科学","F832/313","北京 经济管理出版社 2016","2019-3-2",50,"52.00",198,"img/nbook/nbook7.jpg",1,null,"2008年的金融危机被称为“二战”后最具破坏性的浩劫。金融的顺周期性对危机的加深和影响无疑是显著的。由刘鹏著的《监管视角下的金融顺周期性研究——兼论中国银行业的顺周期效应》聚焦于金融的顺周期性以及金融监管对金融顺周期性的影响，考察经济周期波动与金融顺周期性的内在关联，剖析金融监管体系对金融顺周期性的深层次影响。从监管视角出发，以经济学理论为基础，重点研究中国问题。以中国银行业监管为例分析了《巴塞尔资本协议Ⅲ》实施前金融监管体系对金融顺周期性的作用与影响，并对《巴塞尔资本协议Ⅲ》实施后中国银行业监管的顺周期效应进行了研究和思考。在借鉴成功实践经验和理论研究成果的基础上，结合中国实际给出了缓释金融顺周期性的一些政策建议。","刘鹏，山西省阳泉市人。2012年毕业于中国人民大学经济学院，获经济学博士学位。2012年起，在国家信息中心经济预测部财政金融研究室工作，主要研究方向为金融监管、货币政策、宏观金融研究等。在《国际贸易问题》、《教学与研究》、《经济理论与经济管理》、《中国物价》、《上海证券报》等全国重点学术期刊和报刊上发表论文近20篇。"),
(null,"9787030546104","功能视野下我国职业教育...","董显辉 著","教育学","G719.2/46","北京 科学出版社 2017","2019-3-2",50,"52.00",177,"img/nbook/nbook8.jpg",1,null,"董显辉著的《功能视野下我国职业教育层次结构的调整》以结构功能主义为视角，运用历史研究、比较研究、调查研究等方法，对职业教育层次的本质、结构和功能的关系和合理性运行机制进行了分析研究：一是从职业教育层次结构的历史演变，分析各阶段职业教育层次结构的变化特点和原因，了解职业教育层次结构变化的规律；二是通过对发达国家职业教育层次结构的比较，分析发达国家职业教育层次结构变化的异同，了解发达国家职业教育层次结构的现状和职业教育层次间的衔接途径；三是通过对职业教育层次结构与功能的研究，了解职业教育层次结构的构成因素、职业教育层次结构的特点、影响职业教育层次结构调整的因素、职业教育层次结构调整的类型和职业教育层次结构合理性表现等理论；四是分析我国职业教育层次现状是否符合职业教育自身发展的规律和社会经济发展的客观规律，以及能否满足学生终身学习的意向；五是依据职业教育层次结构的合理性，对职业教育各层次的培养目标、规模结构及各层次间衔接方式提出优化建议。 本书可供教育管理职能部门、职业院校、教育科研部门等管理人员、职业教育教师及科研人员参考。",null),
(null,"9787030507259","英语非人称构式的认知研究...","马应聪 著","英文","H314/486","北京 科学出版社 2017","2019-3-2",50,"52.00",240,"img/nbook/nbook9.jpg",1,null,"马应聪著的《英语非人称构式的认知研究》采用定性和定量研究相结合的方法，在认知语言学相关理论的指导下建构了认知参照场域控制模型，并以该模型为理论框架系统研究了英语非人称构式对述渭的语义制约及其意义建构问题。研究表明，英语非人称构式是一类抽象认知参照点构式，反映人类的一种高级认知能力。研究以真实语料为支撑，为英语非人称构式提供了新的研究视角。 本书的读者对象是英语语言学专业的硕士生和博士生，亦可为认知语言学的相关研究提供借鉴。",null),
(null,"9787030507259","功能视野下我国职业教育...","黑马程序员 编著","教育学","H314/486","北京 科学出版社 2017","2019-3-2",50,"52.00",240,"img/nbook/nbook10.jpg",1,null,"马应聪著的《英语非人称构式的认知研究》采用定性和定量研究相结合的方法，在认知语言学相关理论的指导下建构了认知参照场域控制模型，并以该模型为理论框架系统研究了英语非人称构式对述渭的语义制约及其意义建构问题。研究表明，英语非人称构式是一类抽象认知参照点构式，反映人类的一种高级认知能力。研究以真实语料为支撑，为英语非人称构式提供了新的研究视角。 本书的读者对象是英语语言学专业的硕士生和博士生，亦可为认知语言学的相关研究提供借鉴。",null);




CREATE TABLE nbook_in(
    id INT PRIMARY KEY AUTO_INCREMENT,
    nid INT,
  	catalog VARCHAR(100),        #目录
 	  FOREIGN KEY(nid) references newbook(nid)   
);

#经济科学、中文、计算机

CREATE TABLE borrow(
  id INT PRIMARY KEY AUTO_INCREMENT,
  bookname VARCHAR(20),     #图书名称
  borrowdate VARCHAR(20),   #借阅时间
  Ereturndate VARCHAR(20),  #预计归还时间
  returndate VARCHAR(20),   #预计归还时间
  Manmessage VARCHAR(50),   #管理员消息
  uid INT
);
  -- uid VARCHAR(10),
  -- FOREIGN KEY(uid) references user(uid)  